In [1]:
import pandas as pd
import numpy as np

In [2]:
array_a = np.array([[3, 2, 1], [6, 3, 2]])
array_a

array([[3, 2, 1],
       [6, 3, 2]])

In [3]:
df = pd.DataFrame(array_a)

In [4]:
df

   0  1  2
0  3  2  1
1  6  3  2

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.columns = ['column 1', 'column 2', 'column 3']

In [7]:
df

   column 1  column 2  column 3
0         3         2         1
1         6         3         2

In [8]:
list1 = ["col "+str(col)  for col in range(1, 4) ]

In [9]:
list1

['col 1', 'col 2', 'col 3']

### Common Attributes for Working with DataFrames

In [10]:
data = pd.read_csv('Lending-company.csv', index_col = 'LoanID')
lending_data = data.copy()
lending_data.head()

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [11]:
# index
lending_data.index

Int64Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
            ...
            1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043],
           dtype='int64', name='LoanID', length=1043)

In [12]:
# columns
lending_data.columns

Index(['StringID', 'Product', 'CustomerGender', 'Location', 'Region',
       'TotalPrice', 'StartDate', 'Deposit', 'DailyRate', 'TotalDaysYr',
       'AmtPaid36', 'AmtPaid60', 'AmtPaid360', 'LoanStatus'],
      dtype='object')

In [13]:
# Axes -- Display the index and columns together
lending_data.axes

[Int64Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
             ...
             1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043],
            dtype='int64', name='LoanID', length=1043),
 Index(['StringID', 'Product', 'CustomerGender', 'Location', 'Region',
        'TotalPrice', 'StartDate', 'Deposit', 'DailyRate', 'TotalDaysYr',
        'AmtPaid36', 'AmtPaid60', 'AmtPaid360', 'LoanStatus'],
       dtype='object')]

In [14]:
# datatype
lending_data.dtypes

StringID           object
Product            object
CustomerGender     object
Location           object
Region             object
TotalPrice        float64
StartDate          object
Deposit             int64
DailyRate           int64
TotalDaysYr         int64
AmtPaid36           int64
AmtPaid60           int64
AmtPaid360          int64
LoanStatus         object
dtype: object

In [15]:
# values
lending_data.values

array([['LoanID_1', 'Product B', 'Female', ..., 4166, 14621, 'Active'],
       ['LoanID_2', 'Product D', 'Female', ..., 4096, 16041, 'Active'],
       ['LoanID_3', 'Product B', 'Male', ..., 3205, 16340, nan],
       ...,
       ['LoanID_1041', 'Product A', 'NotSpecified', ..., 5143, 16617,
        'Finished Payment'],
       ['LoanID_1042', 'Product B', 'Female', ..., 3462, 15617,
        'Finished Payment'],
       ['LoanID_1043', 'Product A', 'NotSpecified', ..., 4743, 16617,
        'Finished Payment']], dtype=object)

In [16]:
np.set_printoptions(threshold=np.inf)  # display all the value in jupyter notebook

In [17]:
# shape of your dataframe
lending_data.shape

(1043, 14)

In [18]:
some_cols = pd.read_csv('Lending-company.csv',
                       usecols = ['Location', 'Region', 'LoanID'],
                       index_col='LoanID')

In [19]:
some_cols

           Location    Region
LoanID
1        Location 3  Region 2
2        Location 6  Region 6
3        Location 8  Region 3
4       Location 26  Region 2
5       Location 34  Region 3
...             ...       ...
1039    Location 73  Region 6
1040    Location 82  Region 1
1041    Location 11  Region 4
1042    Location 26  Region 6
1043    Location 94  Region 6

[1043 rows x 2 columns]

### Selection and Indexing of DataFrames

In [20]:
lending_data.head()

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [21]:
# Pass a list of column names
lending_data[['Product', 'CustomerGender', 'TotalPrice']]

          Product CustomerGender  TotalPrice
LoanID
1       Product B         Female     17600.0
2       Product D         Female         NaN
3       Product B           Male     16600.0
4       Product A           Male     17600.0
5       Product B         Female     21250.0
...           ...            ...         ...
1039    Product B           Male     17300.0
1040    Product A           Male         NaN
1041    Product A   NotSpecified     17300.0
1042    Product B         Female     16300.0
1043    Product A   NotSpecified     17300.0

[1043 rows x 3 columns]

In [22]:
from numpy.random import randint
np.random.seed(101) # seed ensures we see the same values

In [23]:
df2 = pd.DataFrame(randint(1,100,(5,4)), index='A B C D E'.split(), 
                   columns='W X Y Z'.split())

In [24]:
df2

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64
D  41  61  93  65
E   6  13  94  41

In [25]:
# SQL syntax for selecting items (Not recommended)
lending_data.Location

LoanID
1        Location 3
2        Location 6
3        Location 8
4       Location 26
5       Location 34
           ...
1039    Location 73
1040    Location 82
1041    Location 11
1042    Location 26
1043    Location 94
Name: Location, Length: 1043, dtype: object

In [26]:
lending_data[['Location']]

           Location
LoanID
1        Location 3
2        Location 6
3        Location 8
4       Location 26
5       Location 34
...             ...
1039    Location 73
1040    Location 82
1041    Location 11
1042    Location 26
1043    Location 94

[1043 rows x 1 columns]

In [27]:
type(lending_data[['Location']])

pandas.core.frame.DataFrame

#### Creating a new column

In [28]:
df2['V'] = df2['W'] + df2['X']

In [29]:
df2[['V']]

     V
A  108
B  152
C  119
D  102
E   19

In [30]:
# Rearranging columns
df2 = df2[['V', 'W', 'X', 'Y', 'Z']]

In [31]:
df2

     V   W   X   Y   Z
A  108  96  12  82  71
B  152  64  88  76  10
C  119  78  41   5  64
D  102  41  61  93  65
E   19   6  13  94  41

### Removing Columns

In [32]:
df2.drop('V', axis=1)

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64
D  41  61  93  65
E   6  13  94  41

In [33]:
df2   # Not inplace unless specified!

     V   W   X   Y   Z
A  108  96  12  82  71
B  152  64  88  76  10
C  119  78  41   5  64
D  102  41  61  93  65
E   19   6  13  94  41

In [34]:
df2.drop('V', axis=1, inplace=True)   #inplace is used to delete permanently

C:\Users\UZOMA\AppData\Local\Temp\ipykernel_7812\3117722798.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('V', axis=1, inplace=True)   #inplace is used to delete permanently

In [35]:
df2

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64
D  41  61  93  65
E   6  13  94  41

#### Removing Rows

In [36]:
df2.drop('E', axis=0)    # Removing row E from our data

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64
D  41  61  93  65

When it comes to selecting rows and columns of a pandas DataFrame, loc and iloc are two commonly used functions.

Here is the subtle difference between the two functions:

* loc selects rows and columns with specific labels
* iloc selects rows and columns at specific integer positions

In [37]:
# select rows with index label 'B' and 'C'
df2.loc[['B', 'C']]

    W   X   Y   Z
B  64  88  76  10
C  78  41   5  64

In [38]:
df2.loc[['B', 'C'], ['Y', 'Z']]

    Y   Z
B  76  10
C   5  64

In [39]:
# Using slicing with loc
df2.loc[:'C', 'X':]

    X   Y   Z
A  12  82  71
B  88  76  10
C  41   5  64

In [40]:
# Indexing with iloc
df2

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64
D  41  61  93  65
E   6  13  94  41

In [41]:
df2.iloc[1:4]

    W   X   Y   Z
B  64  88  76  10
C  78  41   5  64
D  41  61  93  65

In [42]:
df2.iloc[1:4, 2:]

    Y   Z
B  76  10
C   5  64
D  93  65

In [43]:
df2.iloc[[1,2]]

    W   X   Y   Z
B  64  88  76  10
C  78  41   5  64

In [44]:
df2.iloc[:, [4,0,2]]

IndexError: positional indexers are out-of-bounds

## Conditional Selection
An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [46]:
nested_list = [["Brasil", 'Brasilia', 8.516, 200.40],
              ['Russia', 'Moscow', 17.100, 143.50],
              ['India', 'New Dehli', 3.286, 1252.00],
              ['China', 'Beijing', 9.597, 1357.00],
              ['South Africa', 'Pretoria', 1.221, 52.98]]

df = pd.DataFrame(data=nested_list,
                       columns=['Country', 'Capital', 'Area', 'Population'],
                       index = ['BR', 'RU', 'IN', 'CH', 'SA']
                      )

df

         Country    Capital    Area  Population
BR        Brasil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Dehli   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

In [47]:
type(df['Country'])
# Pandas series that shows the countries

pandas.core.series.Series

In [48]:
type(df[['Country']])
# Converting the series to dataframe

pandas.core.frame.DataFrame

In [49]:
df[['Country', 'Population']]

         Country  Population
BR        Brasil      200.40
RU        Russia      143.50
IN         India     1252.00
CH         China     1357.00
SA  South Africa       52.98

In [50]:
df[0:2]

   Country   Capital    Area  Population
BR  Brasil  Brasilia   8.516       200.4
RU  Russia    Moscow  17.100       143.5

In [51]:
df[0:2]['Country']

BR    Brasil
RU    Russia
Name: Country, dtype: object

In [52]:
df2

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64
D  41  61  93  65
E   6  13  94  41

In [53]:
df2 >= 50

       W      X      Y      Z
A   True  False   True   True
B   True   True   True  False
C   True  False  False   True
D  False   True   True   True
E  False  False   True  False

In [54]:
df2[df2 >= 50]

      W     X     Y     Z
A  96.0   NaN  82.0  71.0
B  64.0  88.0  76.0   NaN
C  78.0   NaN   NaN  64.0
D   NaN  61.0  93.0  65.0
E   NaN   NaN  94.0   NaN

In [55]:
y_greater50 = df2['Y'] >= 50

In [56]:
df2[y_greater50]

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
D  41  61  93  65
E   6  13  94  41

In [57]:
is_large = df['Population'] > 200
is_large

BR     True
RU    False
IN     True
CH     True
SA    False
Name: Population, dtype: bool

In [58]:
df[is_large]

   Country    Capital   Area  Population
BR  Brasil   Brasilia  8.516       200.4
IN   India  New Dehli  3.286      1252.0
CH   China    Beijing  9.597      1357.0

In [59]:
df[is_large][['Country', 'Capital']]

   Country    Capital
BR  Brasil   Brasilia
IN   India  New Dehli
CH   China    Beijing

### Logical Operators in Pandas
Pandas dataframes allow for boolean indexing which is quite an efficient way to filter a dataframe for multiple conditions. In boolean indexing, boolean vectors generated based on the conditions are used to filter the data. Multiple conditions involving the operators | (for or operation), & (for and operation), and ~ (for not operation) can be grouped using parenthesis ().

In [60]:
is_huge = df['Population'] > 200 and df['Area'] > 5
is_huge    # Error Expected

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [61]:
is_huge = (df['Population'] > 200) & (df['Area'] > 5)
is_huge

BR     True
RU    False
IN    False
CH     True
SA    False
dtype: bool

In [62]:
df[is_huge]

   Country   Capital   Area  Population
BR  Brasil  Brasilia  8.516       200.4
CH   China   Beijing  9.597      1357.0

### Numpy Logical Operators
* numpy.logical_and
* numpy.logical_or
* numpy.logical_not

In [63]:
import numpy as np

In [64]:
is_huge2 = np.logical_and(df["Population"] > 200, df['Area'] >5 ) 
df[is_huge2]

   Country   Capital   Area  Population
BR  Brasil  Brasilia  8.516       200.4
CH   China   Beijing  9.597      1357.0

In [66]:
is_huge3 = np.logical_and(df['Population'] < 1000, df['Area'] > 10) 
df[is_huge3]

   Country Capital  Area  Population
RU  Russia  Moscow  17.1       143.5

### Multi-Index and Index Heirachy
Python's zip() function creates an iterator that will aggregate elements from two or more iterables. You can use the resulting iterator to quickly and consistently solve common programming problems, like creating dictionaries.

In [67]:
x = [1,2,3]
y = [4,5,6]
zipped = zip(x, y)

In [68]:
type(zipped)

zip

In [70]:
list(zipped)

[(1, 4), (2, 5), (3, 6)]

In [71]:
namelist = ['Alvan', 'Ikoku', 'Femi']
grades = ['2.1', '2.2', '1']
zipped2 = zip(namelist, grades)
list(zipped2)

[('Alvan', '2.1'), ('Ikoku', '2.2'), ('Femi', '1')]

In [74]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))

In [75]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [76]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [78]:
print(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [79]:
df4 = pd.DataFrame(np.random.randint(1,20,(6, 2)), index=hier_index, columns=['A', 'B'])
df4

       A   B
G1 1  18  16
   2   9   3
   3  13   9
G2 1  11  13
   2  12   1
   3  10  10

In [80]:
df4.loc['G1']

    A   B
1  18  16
2   9   3
3  13   9

In [82]:
df4.loc['G1'].loc[[2], ['B']]

   B
2  3